000100 IDENTIFICATION DIVISION.

000200 PROGRAM-ID. helloworld.

000300 PROCEDURE DIVISION.

000400 DISPLAY "Hello World!".

000500 DISPLAY "Feito no Cobol"

000600 STOP RUN.
